1.
2.
3.
4.
5. получаем таблицу-результат и нам нужно сделать из нее сводную
6. нажимаешь на свободную справа (снизу)
7. в поиске набираю "сводная таблица"
8. выбираю нужный диапазон - выбираем все ячейки
9. и на место выбранной ячейки вставляется новая пустая сводная таблица
10. выбираем два (или сколько то) нужных в настройках уже сводной таблицы
: название строки (предмета, товара, магазина) и сумма выручки (продаж, покупок)
следим за тем,чтобы в "Строки" попало название, а в "Значения" - сумма по полю выручки, или что либо
11. Сортируем таблицу сводную как надо с помощью "Дополнительные параметры сортировки"




ВПР
1. выбираю ячейку, в которую нужно подставить значение из другой таблицы
2. пишу =ВПР()
3. Выбираю в искомой таблице столб по которому ищем соответсвие
4. ставлю ;
5. перехожу во вкладку с нужной таблицей откуда брать
6. выделяешь все столбцы
7. ставим ;
8. ставим номер столбца откуда брать, номер из всех которые выделены
9. ставим ;
10. ставим 0
11. закрываем скобку, если не закрыта
12. должна получится формула вида =ВПР(@C:C;Магазин!A:B;2;0), то либо эксель, либо сами ставим собачку вначале
13. растягиваем по столбцу, нажав на квадратик справа снизу у ячейки

ФУНКЦИЯ СУММ и ПРОИЗВЕД: два параметра, либо диапазон



СВОДНЫЕ ТАБЛИЦЫ
У НАС ЕСТЬ ПРОДАЖИ, разных магазинов, разного кол-ва товаров, один и тот магазин в проадажах попадается несколько раз,
чтобы посчитать общее кол-во проданных товаров для каждого магазина
1. выбираем ячейку куда вставить сводную табл
2. в поиске находим сводную таблицу
3. дважды кликаем по ней
4. она вставилась
5. мы выбираем в свойствах нужные поля для отображения (номер магазина, и кол-во товара)
6. смотрим чтобы в строках был магазин, а в значением, то что должны проссумировать
7. готово
8. потом можно применить фильтр по убыванию или ..., он находится в Дополнительных параметрах сортировки столбца слева, нужно выбрать нужный столбец для сортировки
