1.
2.
3.
4.
5. получаем таблицу-результат и нам нужно сделать из нее сводную
6. нажимаешь на свободную справа (снизу)
7. в поиске набираю "сводная таблица"
8. выбираю нужный диапазон - выбираем все ячейки
9. и на место выбранной ячейки вставляется новая пустая сводная таблица
10. выбираем два (или сколько то) нужных в настройках уже сводной таблицы
: название строки (предмета, товара, магазина) и сумма выручки (продаж, покупок)
следим за тем,чтобы в "Строки" попало название, а в "Значения" - сумма по полю выручки, или что либо
11. Сортируем таблицу сводную как надо с помощью "Дополнительные параметры сортировки"


