4 * t * 44 * 16	     160
----------------- = ----
t * x * 8             10


4 * 44 * 16 = 160
1 * x  * 8  = 10

44 * 16 = 40
x  * 8  = 10

44 * 8 = 20
x * 8 = 10
x = 22



1 бит
1 байт = 8 бит
1 КБайт = 1024 КБайт
1 МБайт = 1024 КБайт
1 ГБайт = 1024 МБайт
1 ТБайт = 1024 ГБайт



24 * 16000 = 384000 - биты на дискретизаию, размер секунды
384000 * 90 = 34560000 - размер 90а секунд
34560000 * 2 = 69120000 - стерео по каналам
69120000:64000 = 1080




45 * 8 = 360 - килобиты
1024 * 360 = 368640 -биты

368640 - 16
х - 100
368640 : 16 = 23040 - 1 процент
2304000 - 100 процентов

2 * 48000 * x = 2304000
x = 2304000 / 96000
x = 24




1 * d * b = 28 Мбайт
2 * d * 1/2 * b * 3,5 = x
1/3,5 = 28/x
x = 98





